using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

public class Professions
{
    public Professions() { }

    public static string GetRandomProfession()
    {
        Random R = new Random();
        List<string> Professions = ProfessionsList();
        return Professions.ElementAt(R.Next(1, Professions.Count));
    }

    public static List<string> ProfessionsList()
    {
        return new List<string>()
        {
            "רכזת פרוייקטים",
            "מנהלת אדמיניסטרטיבית",
            "מנהל/ת תפעול",
            "מנהלת רכש",
            "אשת יחסי ציבור",
            "רכזת משאבי אנוש",
            "מזכירה",
            "מנהלת משאבי אנוש",
            "פקידת",
            "פקידת קבלה",
            "מתאמת",
            "אדמיניסטרציה",
            "כוח אדם",
            "אחראית ניהול מלאי",
            "ניהול משרד",
            "מנהלת השתלמויות",
            "מנהלת צוות",
            "פקידת גבייה",
            "פקידת ביטוח",
            "אחראית ניהול",
            "אחראית רכש",
            "פקידת רכש",
            "מנהלת תפעול",
            "מנהלת הדרכה",
            "מנהלת חשבונות",
            "מנהלת משרד",
            "אחראית משרד",
            "פקידת משרד",
            "מנהלת שיווק",
            "אחראית שיווק",
            "פקידת שיווק",
            "ייבוא וייצוא",
            "מנהלת פרוייקטים",
            "אחראית משאבי אנוש",
            "פקידת עורך דין",
            "מזכירת עורך דין",
            "אחראית כספים",
            "מנהלת כספים",
            "מזכירות",
            "פקידת ייבוא",
            "פקידת ייצוא",
            "פקידת מחסן",
            "פקידת מחסן רכש",
            "רכזת עמדה",
            "פקידה במחלקת חשבונות",
            "פקידת דוקומנטים",
            "פקידה זמנית",
            @"מזכירת מנכ""ל",
            "מזכירה רפואית",
            "פקידת מוקד",
            "מנהלת מוקד",
            "מתאמת פגישות",
            "מתאמת מכירות",
            "פקידת שטח",
            "מזכירת ערב",
            "מזכירה למשרד",
            @"פקידה למזכירת מנכ""ל",
            "רכזת עמדה",
            "פקידת משלוחים",
            "אחראית תפעול",
            "מזכירת שיווק",
            "מנהלת בק אופיס",
            "אחראית ייבוא",
            "אחראית ייצוא",
            "מוקדנית",
            "מזכירת הנהלה",
            @"מזכירת משנה למנכ""ל",
            "עובדת אדמיניסטרציה",
            "רפרנטית שירות",
            "רכזת משאבי אנוש",
            "מזכירה לאגף שיקומי",
            "מתאמת אספקות",
            "מזכירה אישית",
            "מזכירת מטה",
            "מזכירת סניף",
            "מנהלת סניף",
            "אחראית סניף",
            "רכזת סניף"
        };
    }
}